raibisch/ESP32_ABL/src/main.cpp
/* ------------------until now not used--------------------------
static String ByteToAscii(byte input) 
{
  char singleChar, out;
  char asciiString[2+1] {0,0,0}; 
  sprintf(asciiString, "%2X", input);
  return String(asciiString);
}

char ByteToAscii(const char *input) 
{
  char singleChar, out;
  memcpy(&singleChar, input, 2);
  sprintf(&out, "%c", (int)strtol(&singleChar, NULL, 16));
  return out;
}

static byte calculateLRC(String s)
{
    byte LRC = 0;
    for (int i = 0; i < s.length(); i++)
    {
        LRC ^= (byte)s[i];
    }
    return LRC;
}
---------------------------not used -------------------------*/


////////////////////////////////////////////
/// @brief init builtin LED
////////////////////////////////////////////
void initLED()
{
  pinMode(LED_GPIO, OUTPUT);
  digitalWrite(LED_GPIO, HIGH);
}

/// @brief  set builtin LED
/// @param i = HIGH / LOW
void setLED(uint8_t i)
{
  digitalWrite(LED_GPIO, i);
}


//////////////////////////////////////////////////////
/// @brief  expand Class "FileVarStore" with variables
//////////////////////////////////////////////////////
class ABL_FileVarStore : public FileVarStore
{
 public:  
  // Device-Parameter
   String varDEVICE_s_Name  = "Wallbox";

   // ABL-Parameter
   uint16_t varABL_i_A_soll_high = 14;
   uint16_t varABL_i_A_soll_low  = 6;
   uint16_t varABL_i_U_netz = 230;
   uint32_t varABL_i_Scantime_ms = 30000;
   uint32_t varABL_i_logtime_ms  = 2000;
   uint16_t varABL_i_Watt_16A;
   uint16_t varABL_i_Watt_12A;
   uint16_t varABL_i_Watt_08A;
   uint16_t varABL_i_Watt_06A;

  // Wifi-Parameter
   String varWIFI_s_Mode    = "STA"; // STA=client connect with Router,  AP=Access-Point-Mode (needs no router)
   String varWIFI_s_Password= "mypassword";
   String varWIFI_s_SSID    = "myssid";


 protected:
   void GetVariables()
   {
     varDEVICE_s_Name     = GetVarString(GETVARNAME(varDEVICE_s_Name));
     varWIFI_s_Mode       = GetVarString(GETVARNAME(varWIFI_s_Mode)); //STA or AP
     varWIFI_s_Password   = GetVarString(GETVARNAME(varWIFI_s_Password));
     varWIFI_s_SSID       = GetVarString(GETVARNAME(varWIFI_s_SSID));

     varABL_i_U_netz      = GetVarInt(GETVARNAME(varABL_i_U_netz));
     varABL_i_A_soll_low  = GetVarInt(GETVARNAME(varABL_i_A_soll_low));
     varABL_i_A_soll_high = GetVarInt(GETVARNAME(varABL_i_A_soll_high),16);
     varABL_i_Scantime_ms = GetVarInt(GETVARNAME(varABL_i_Scantime_ms),30000);  

     varABL_i_Watt_16A    = GetVarInt(GETVARNAME(varABL_i_Watt_16A),(225*2*16));
     varABL_i_Watt_12A    = GetVarInt(GETVARNAME(varABL_i_Watt_12A),(225*2*12));
     varABL_i_Watt_08A    = GetVarInt(GETVARNAME(varABL_i_Watt_08A),(225*2*8));
     varABL_i_Watt_06A    = GetVarInt(GETVARNAME(varABL_i_Watt_06A),(225*2*6));
   }
};
ABL_FileVarStore varStore;

void initFileVarStore()
{
  varStore.Load();
}

/// @brief do not wait for next polling periode
static void forcePolling()
{
      ABL_PollTime_old  = millis() + varStore.varABL_i_Scantime_ms;
}

 
/// @brief ABL Rx-Timeout after 2 polling periodes
bool testTimeount()
{
        ABL_rx_timeoutcount++;

// DEBUG: Simulate status        
#ifdef DEBUG_WITHOUT_ABL
#pragma message("Info : DEBUG_WITHOUT_ABL=1")
        //ABL_rx_Ipwm = 16;
        ABL_rx_Ipwm = 10;
        debug_printf("ABL_rx_timeoutcount:%d\r\n", ABL_rx_timeoutcount);
        if (ABL_rx_timeoutcount < 2)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_A1];
        }
        else
        if (ABL_rx_timeoutcount < 3)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_C2];
        }
        else
        if (ABL_rx_timeoutcount < 4)
        {
          ABL_rx_status = "?";
        } 
        else
        if (ABL_rx_timeoutcount < 8)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_C2];
        } 
        else
        if (ABL_rx_timeoutcount < 9)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_B2];
        }
        else
        if (ABL_rx_timeoutcount < 10)
        {
          ABL_rx_status = "?";
        }
        else
        if(ABL_rx_timeoutcount < 11)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_A1];
        }
        else
        if(ABL_rx_timeoutcount < 12)
        {
          ABL_rx_status = "F1"; // simulate Error Message
        }
        else
        {
          ABL_rx_timeoutcount = 0;
          ABL_rx_status = ABL_STATUS_STRING[ABL_B1];
        }
        return false;
#else
        if (ABL_rx_timeoutcount > 2)
        {
          ABL_rx_status = ABL_STATUS_STRING[ABL_TIMEOUT];
          return true;
        }
        return false;
#endif
}

// ---- EEPROM Simulation to save Values over Reset and Poweroff-------
Preferences hist;

void initHistory()
{
   hist.begin("history", false); // use history
   ABL_Wh_Sum_old = hist.getULong64("whsum",0);
   ABL_Wh_Sum_akt = ABL_Wh_Sum_old;
   debug_printf("restored ABL_Wh_Sum_old= %d\r\n",ABL_Wh_Sum_old);
   SYS_RestartCount = hist.getInt("restart",0);
   SYS_TimeoutCount = hist.getInt("timeout",0);
   SYS_ChargeCount =  hist.getInt("charge",0);
   debug_printf("restored = %d\r\n",SYS_RestartCount);
}


bool set_Wh_Sum(unsigned long whs)
{
  hist.putULong64("whsum", whs);
  return true;
}


bool saveHistory()
{
   ABL_Wh_Sum_old = ABL_Wh_Sum_akt;
   debug_printf("ABL_Wh_Sum_akt:%d\r\n",ABL_Wh_Sum_akt)
   hist.putULong64("whsum",ABL_Wh_Sum_akt);
   hist.putUInt("restart", SYS_RestartCount);
   hist.putUInt("timeout", SYS_TimeoutCount);
   return true;
}
// ----  END EPROM Simulation -----------------------------------------

//////////////////////////////////////////////////////////
static double Wh = 0;
/// @brief calculate aktual an total (sum) of W/h
/// @param polltime_ms 
/// @return 
/////////////////////////////////////////////////////////
void calculate_kWh()
{
   if (ABL_rx_status.startsWith("?")) // no calulation at unvalid data
   {
    return;
   }

   if (ABL_rx_status.startsWith("no")) // no calulation at timeout
   {
    return;
   }

   if (ABL_rx_status_old != ABL_rx_status) // Status is changing
   {

    // end charging
    if (ABL_rx_status_old.startsWith("C"))
    {
      saveHistory();
      hist.putInt("charge",SYS_ChargeCount++);
    }
    
    // start charging
    if (ABL_rx_status.startsWith("C"))
    {
      saveHistory();
      rtc.setTime(1);
      ABL_PollTime_old = 1;
      ABL_rx_Isum = 0;
      ABL_rx_kW = 0;
    }
  
    if (ABL_rx_status.startsWith("A"))
    {
      saveHistory();
      ABL_rx_Isum = 0;
      ABL_rx_kW = 0;
      ABL_rx_Wh = 0;
      ABL_sChargeTime = "        ";
    }
    ABL_rx_status_old = ABL_rx_status;
   } // End Status is changing

   if (ABL_rx_status.startsWith("C")) // is charging
   {
      if ( ABL_rx_Isum == 0) // virtual I-values: calculation with Watt Values from config-values
      {
           switch (ABL_rx_Ipwm)
           { 
            case 6:
            ABL_rx_kW = varStore.varABL_i_Watt_06A / 1000.0;
           break; 

           case 8:
            ABL_rx_kW = varStore.varABL_i_Watt_08A / 1000.0;
           break; 

